# __del__方法
    # 在清除一个对象在内存中的使用的时候
    # 会触发这个对象所在的类中的析构方法
# item系列
    # 对象[] 就需要实现item系列
    # getitem  obj['wioe']
    # setitem  obj['uyr'] = jash
    # delitem  del obj['asfjh']
# __hash__方法  hash()
    # 在同一次执行中,相同的值hash值总是一样的
    # set的去重
    # 字典的快速查找
# __eq__方法
    #  ==
    #  set的去重

# 模块
# 模块的分类
    # 内置的
    # 扩展的/第三方的
    # 自定义   py文件
# import 文件名
# 文件名 : 要求和变量名的规范一样
# 模块不会被多次导入
# 模块的导入相当于执行这个文件
# 模块有自己独立的命名空间
# 重命名 as
# 导入多个模块
    # 一行导入多个 逗号隔开 不建议使用
    # 多行导入多个 : 内置 第三方 自定义的顺序







